a = tuple(range(30,100,10))
b = list(range(30,100,10))
print(a)
print(b)
print(type(range(10,40,10)))
print(type(a))
#3、 0 18 36,72,90,108,126,144,162,180,198

c = [x*2 for x in range(100) if x%9==0]
print(c)

# 4、使用二维列表存储表格信息，并画出简单的内存存储示意图：
info =[['小白',18,30000,'北京'],['小黑',19,20000,'上海'],['小明',20,15000,'深圳']]
# print(info)
# print(info[1][0])
#
# 5、元组和列表的共同点？有哪些不同点
'''都可以通过索引访问；都是序列，都可以通过切片访问。
不同点：元组不可变，不可删除添加元素，列表可以
'''
#6、"""
# 创建一个字典对象，包含如下信息： 支出金额：300.15，支出日期：2018.10.18，支出人：高小七
# """
dict1 = {'支出金额':300.15,'支出日期':'2018.10.18','支出人':'小白'}
print(dict1)

#7. 使用字典存储行数据，最后将整个表使用列表存储起来。
r1 = {'name':'小白','age':18,'salary':30000,'city':'北京'}
r2 = {'name':'小黑','age':19,'salary':20000,'city':'上海'}
r3 = {'name':'小明','age':20,'salary':10000,'city':'深圳'}

tb = [r1,r2,r3]

print(tb[1].get('salary'))
